БухЭксп/InformationRegisters/CW_ХарактеристикиГрузоперевозок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_ХарактеристикиГрузоперевозок</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.CW_ПараметрыГрузоперевозок</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеПлан</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеФакт</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ХранилищеДанных</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИдентификаторВладельца</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Служебный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Порядок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Грузоперевозка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_Грузоперевозки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Параметр</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.CW_ПараметрыГрузоперевозок</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/Catalogs/CW_Грузоперевозки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>CW_Грузоперевозки</Name>
			<Comment>Грузоперевозки</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
			<BasedOn>
				<xr:Item>Catalog.CW_Заявки</xr:Item>
			</BasedOn>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаСделкиФ</Name>
					<Comment>Дата сделки (фактическая)</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Comment>Клиент</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Комментарий</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МенеджерПродаж</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОперативныйМенеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Груз</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_Грузы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Маршрут</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_МаршрутыГрузоперевозок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипПеревозки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ТипыПеревозок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Типоразмер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ТипоразмерыКонтейнеров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CW_Представление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_Заказы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СодержитДинамическиеПараметры</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Архив</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Незаполнена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заявка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_Заявки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтслеживаемоеОборудование</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ОтслеживаемоеОборудование</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПривязкиОборудования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтключитьСлежение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомментарийБюджета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Перекодирована</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Коносамент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_Коносаменты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПараметрыГрузоперевозки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Параметр</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.CW_ПараметрыГрузоперевозок</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.CW_ПараметрыГрузоперевозок</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Примечание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1000</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеПлан</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеФакт</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХранилищеДанных</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторВладельца</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КонтрагентыПоБюджету</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.CW_Контрагенты</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ГруппыПараметровГрузоперевозки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Идентификатор</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторВедущего</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторыВедомых</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Раскрывать</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторГруппы</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторВладельца</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Порядок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

БухЭксп/Catalogs/CW_ТомаАрхива.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>CW_ТомаАрхива</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Путь</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основной</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТолькоЧтение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Активный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Платформа</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CW_Платформа</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

БухЭксп/HTTPServices/CW_AFLK/Ext/Module.bsl
Функция testconnectionget(Запрос)
	Ответ = CW_РаботаСВнешнимиРесурсамиСервер.Ответ(200);
	Возврат Ответ;
КонецФункции

Функция datapost(Запрос)
	
	Том = ПолучитьТом();
	мИдетифкаторы = Новый Массив;
	
	Тело = Запрос.ПолучитьТелоКакСтроку();
	
	ХМЛ = Новый ЧтениеXML;
	ХМЛ.УстановитьСтроку(Тело);

	ПостроительDOM = Новый ПостроительDOM; 
	ДокументDOM = ПостроительDOM.Прочитать(ХМЛ);
	
	Элементы_task = ДокументDOM.ПолучитьЭлементыПоИмени("task"); //Заявки
	Для Каждого Элемент_task из Элементы_task Цикл  //профили
		
		ИдентификаторГрузоперевозки = CW_ОбщийМодульЛичныйКабинетСервер.ПолучитьЗначениеИменованногоЭлемента(Элемент_task, "uid", Тип("УникальныйИдентификатор"));
		СсылкаГрузоперевозки 	= Справочники.CW_Грузоперевозки.ПолучитьСсылку(ИдентификаторГрузоперевозки);
		
		ГрузоперевозкаОбъект 	= СсылкаГрузоперевозки.ПолучитьОбъект();
		Если ГрузоперевозкаОбъект = Неопределено Тогда
			ГрузоперевозкаОбъект = Справочники.CW_Грузоперевозки.СоздатьЭлемент();
			ГрузоперевозкаОбъект.ДополнительныеСвойства.Вставить("РассчитатьСтатусыПриЗаписи", Истина);
			ГрузоперевозкаОбъект.УстановитьСсылкуНового(СсылкаГрузоперевозки);
		КонецЕсли;
	
		ИдентификаторТипаперевозки 	= CW_ОбщийМодульЛичныйКабинетСервер.ПолучитьЗначениеИменованногоЭлемента(Элемент_task, "type", Тип("УникальныйИдентификатор"));
		Если ЗначениеЗаполнено(ИдентификаторТипаперевозки) Тогда
			
			СсылкаТипПеревозки	= Справочники.CW_ТипыПеревозок.ПолучитьСсылку(ИдентификаторТипаперевозки);
			
			ОбъектТипПеревозки	= СсылкаТипПеревозки.ПолучитьОбъект();
			Если ОбъектТипПеревозки = Неопределено Тогда
				СсылкаТипПеревозки = Справочники.CW_ТипыПеревозок.ПустаяСсылка();	
			КонецЕсли;
		Иначе
			СсылкаТипПеревозки = Справочники.CW_ТипыПеревозок.ПустаяСсылка();	
		КонецЕсли;
		
		ГрузоперевозкаОбъект.ТипПеревозки = СсылкаТипПеревозки;
		
		КодГрузоперевозки = CW_ОбщийМодульЛичныйКабинетСервер.ПолучитьЗначениеИменованногоЭлемента(Элемент_task, "code", Тип("Строка"));
		ГрузоперевозкаОбъект.CW_Представление 	= КодГрузоперевозки;
		ГрузоперевозкаОбъект.Наименование 		= КодГрузоперевозки;
		
		ДатаСделкиФ = CW_ОбщийМодульЛичныйКабинетСервер.ПолучитьЗначениеИменованногоЭлемента(Элемент_task, "date", Тип("Дата"));
	    ГрузоперевозкаОбъект.ДатаСделкиФ 	= ДатаСделкиФ;
		
		Элементы_Content = Элемент_task.ПолучитьЭлементыПоИмени("Content"); 	//Content
		Если Элементы_Content.Количество() > 0 тогда
			Элемент_Content					= Элементы_Content.Элемент(0);
			ГрузоперевозкаОбъект.Примечание	= XMLЗначение(Тип("Строка"),Элемент_Content.ТекстовоеСодержимое);
		КонецЕсли;
		
		Элементы_result = Элемент_task.ПолучитьЭлементыПоИмени("result"); 	//result
		Если Элементы_result.Количество() > 0 тогда
			Элемент_result	= Элементы_result.Элемент(0);
			result 			= XMLЗначение(Тип("Строка"),Элемент_result.ТекстовоеСодержимое);
		КонецЕсли;
		
		Элементы_decision = Элемент_task.ПолучитьЭлементыПоИмени("decision"); 	//decision
		Если Элементы_decision.Количество() > 0 тогда
			Элемент_decision	= Элементы_decision.Элемент(0);
			decision 			= XMLЗначение(Тип("Строка"),Элемент_decision.ТекстовоеСодержимое);
		КонецЕсли;
		
		Комментарий = "";
		Если Не ПустаяСтрока(decision) Тогда
			Комментарий = Комментарий + "ОПИСАНИЕ РЕШЕНИЯ: " + Символы.ПС + decision;
		КонецЕсли;
		
		Если Не ПустаяСтрока(decision) Тогда
			Если Не ПустаяСтрока(result) Тогда
				Комментарий = Комментарий + Символы.ПС+Символы.ПС;
			КонецЕсли;
			Комментарий = Комментарий + "ОЖИДАЕМЫЙ РЕЗУЛЬТАТ: "+Символы.ПС + result; 
		КонецЕсли;
		
		ГрузоперевозкаОбъект.Комментарий = Комментарий;
		
		Элементы_client = Элемент_task.ПолучитьЭлементыПоИмени("client"); 	//client
		Если Элементы_client.Количество() > 0 тогда
			Элемент_client			= Элементы_client.Элемент(0);
			ИдентификаторКлиента	= CW_ОбщийМодульЛичныйКабинетСервер.ПолучитьЗначениеИменованногоЭлемента(Элемент_client, "uid", Тип("УникальныйИдентификатор"));
			НаименованиеКлиента		= CW_ОбщийМодульЛичныйКабинетСервер.ПолучитьЗначениеИменованногоЭлемента(Элемент_client, "name", Тип("Строка"));
			ИННКлиента 				= CW_ОбщийМодульЛичныйКабинетСервер.ПолучитьЗначениеИменованногоЭлемента(Элемент_client, "inn", Тип("Строка"));
			
			ЗаписатьКонтрагента = Ложь;
			
			КонтрагентСсылка 	= Справочники.Контрагенты.ПолучитьСсылку(ИдентификаторКлиента);
			КонтрагентОбъект 	= КонтрагентСсылка.ПолучитьОбъект();
			Если КонтрагентОбъект = Неопределено Тогда
				КонтрагентОбъект = Справочники.Контрагенты.СоздатьЭлемент();
				КонтрагентОбъект.УстановитьСсылкуНового(КонтрагентСсылка);
				КонтрагентОбъект.Наименование 		= НаименованиеКлиента;
				КонтрагентОбъект.ИНН 				= ИННКлиента;
				
				КонтрагентОбъект.СтранаРегистрации 			= ПредопределенноеЗначение("Справочник.СтраныМира.Россия");
				КонтрагентОбъект.ЮридическоеФизическоеЛицо	= ПредопределенноеЗначение("Перечисление.ЮридическоеФизическоеЛицо.ЮридическоеЛицо");
				
				НоваяСтрока = КонтрагентОбъект.ИсторияНаименований.Добавить();
				НоваяСтрока.Период 				= Дата(1980,1,1);
				НоваяСтрока.НаименованиеПолное 	= НаименованиеКлиента;
				
				КонтрагентОбъект.ОбменДанными.Загрузка = истина;
				ЗаписатьКонтрагента = Истина;
			КонецЕсли;
			
			Если КонтрагентСсылка.Наименование <> НаименованиеКлиента Тогда
				КонтрагентОбъект.Наименование = НаименованиеКлиента;
				
				НоваяСтрока = КонтрагентОбъект.ИсторияНаименований.Добавить();
				НоваяСтрока.Период 				= ДатаСделкиФ;
				НоваяСтрока.НаименованиеПолное 	= НаименованиеКлиента;
				
				ЗаписатьКонтрагента = Истина;
			КонецЕсли;
			Если КонтрагентСсылка.ИНН <> ИННКлиента Тогда
				КонтрагентОбъект.ИНН 	= ИННКлиента;
				ЗаписатьКонтрагента = Истина;
			КонецЕсли;
			
			Если ЗаписатьКонтрагента Тогда
				КонтрагентОбъект.ОбменДанными.Загрузка = истина;
				КонтрагентОбъект.Записать();
			КонецЕсли;
				
			ГрузоперевозкаОбъект.Клиент = КонтрагентСсылка;
			
		КонецЕсли;
		
		//Параметры
		НаборЗаписей = РегистрыСведений.CW_ХарактеристикиГрузоперевозок.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Грузоперевозка.Установить(СсылкаГрузоперевозки);
		
		ГрузоперевозкаОбъект.ПараметрыГрузоперевозки.Загрузить(СсылкаТипПеревозки.ПараметрыГрузоперевозки.Выгрузить());
		ГрузоперевозкаОбъект.ГруппыПараметровГрузоперевозки.Загрузить(СсылкаТипПеревозки.ГруппыПараметровГрузоперевозки.Выгрузить());

		//Добавляем предпоерделенные значения параметров
		СтруктураПараметров = CW_Мониторинг.ПолучитьПредопределенныеПараметры(СсылкаТипПеревозки, "ТипПеревозки", Новый УникальныйИдентификатор);
		CW_Мониторинг.ДобавитьПредопределенныеПараметры(ГрузоперевозкаОбъект,СтруктураПараметров.Параметры);
		//Добавляем предпоерделенные значения параметров
		
		Элементы_parameter = Элемент_task.ПолучитьЭлементыПоИмени("parameter"); 	
		Для Каждого Элемент_parameter из Элементы_parameter Цикл  
			ИдентификаторПараметра	= CW_ОбщийМодульЛичныйКабинетСервер.ПолучитьЗначениеИменованногоЭлемента(Элемент_parameter, "uid", Тип("УникальныйИдентификатор"));
			ТипЗначенияПараметра	= CW_ОбщийМодульЛичныйКабинетСервер.ПолучитьЗначениеИменованногоЭлемента(Элемент_parameter, "type", Тип("Строка"));
			ЗначениеПараметра		= CW_ОбщийМодульЛичныйКабинетСервер.ПолучитьЗначениеИменованногоЭлемента(Элемент_parameter, "value", Тип(ТипЗначенияПараметра));
			
			ПараметрСсылка = ПланыВидовХарактеристик.CW_ПараметрыГрузоперевозок.ПолучитьСсылку(ИдентификаторПараметра);
			ПараметрОбъект = ПараметрСсылка.ПолучитьОбъект();
			
			Если ПараметрОбъект = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			НайденнаяСтрока = ГрузоперевозкаОбъект.ПараметрыГрузоперевозки.Найти(ПараметрСсылка,"Параметр");
			Если НайденнаяСтрока <> Неопределено Тогда
				НайденнаяСтрока.Значение = ЗначениеПараметра;
				
				Если ПараметрСсылка.ЭтоКонтрольнаяДата Тогда
					НайденнаяСтрока.ЗначениеПлан	= ЗначениеПараметра;
					НайденнаяСтрока.ЗначениеФакт	= ЗначениеПараметра;
				КонецЕсли;
		
				ЗаписьНабора = НаборЗаписей.Добавить();
				ЗаписьНабора.Грузоперевозка = СсылкаГрузоперевозки;
				ЗаписьНабора.Параметр 		= ПараметрСсылка;
				ЗаписьНабора.Значение 		= ЗначениеПараметра;
				
				Если ПараметрСсылка.ЭтоКонтрольнаяДата Тогда
					ЗаписьНабора.ЗначениеПлан	= ЗначениеПараметра;
					ЗаписьНабора.ЗначениеФакт	= ЗначениеПараметра;
				КонецЕсли;
			КонецЕсли;
			
		Конеццикла;
		
		НаборЗаписей.Записать(Истина);
		//Параметры
		
		//Файлы
		Элементы_file = Элемент_task.ПолучитьЭлементыПоИмени("file"); 	
		Для Каждого Элемент_file из Элементы_file Цикл  
			
			НаименованиеОбъектаАрхива	= CW_ОбщийМодульЛичныйКабинетСервер.ПолучитьЗначениеИменованногоЭлемента(Элемент_file, "name", 		Тип("Строка"));
			ИмяФайлаБезРасширения		= CW_ОбщийМодульЛичныйКабинетСервер.ПолучитьЗначениеИменованногоЭлемента(Элемент_file, "filename", 	Тип("Строка"));
			Расширение					= CW_ОбщийМодульЛичныйКабинетСервер.ПолучитьЗначениеИменованногоЭлемента(Элемент_file, "extension", Тип("Строка"));
			Комментарий					= CW_ОбщийМодульЛичныйКабинетСервер.ПолучитьЗначениеИменованногоЭлемента(Элемент_file, "note", 		Тип("Строка"));
			
			Элементы_binarydata = Элемент_file.ПолучитьЭлементыПоИмени("binarydata"); 	
			Если Элементы_binarydata.Количество() > 0 Тогда
				Элемент_binarydata = Элементы_binarydata.Элемент(0);
				
				МассивДвоичныхДанных = Новый Массив;
				Для каждого Элемент_part из Элемент_binarydata.ДочерниеУзлы Цикл
					ДвоичныеДанные = Base64Значение(Элемент_part.ТекстовоеСодержимое);
					МассивДвоичныхДанных.Добавить(ДвоичныеДанные);
				КонецЦикла;
				
				ПолныеДвоичныеДанные = СоединитьДвоичныеДанные(МассивДвоичныхДанных);
				РазмерБайт 			 = ПолныеДвоичныеДанные.Размер();
				
				Хранение 			 = ПоместитьВоВременноеХранилище(ПолныеДвоичныеДанные);

			КонецЕсли;
			
			ИдентификаторТипаДокументов	= CW_ОбщийМодульЛичныйКабинетСервер.ПолучитьЗначениеИменованногоЭлемента(Элемент_file, "type", Тип("УникальныйИдентификатор"));
			
			Если ЗначениеЗаполнено(ИдентификаторТипаДокументов) Тогда
				ТипДокументаСсылка = Справочники.CW_ТипыДокументовФайловогоАрхива.ПолучитьСсылку(ИдентификаторТипаДокументов);
				ТипДокументаОбъект = ТипДокументаСсылка.ПолучитьОбъект();
				Если ТипДокументаОбъект = Неопределено Тогда
					ТипДокументаСсылка = ПредопределенноеЗначение("Справочник.CW_ТипыДокументовФайловогоАрхива.ПустаяСсылка");
				КонецЕсли;
			Иначе
				ТипДокументаСсылка = ПредопределенноеЗначение("Справочник.CW_ТипыДокументовФайловогоАрхива.ПустаяСсылка");
			КонецЕсли;
			
			ИдентификаторОбъектаАрхива	= CW_ОбщийМодульЛичныйКабинетСервер.ПолучитьЗначениеИменованногоЭлемента(Элемент_file, "uid",  Тип("УникальныйИдентификатор"));
			ОбъектыАрхиваСсылка 		= Справочники.CW_ОбъектыАрхива.ПолучитьСсылку(ИдентификаторОбъектаАрхива);
			
			ОбъектыАрхиваОбъект = ОбъектыАрхиваСсылка.ПолучитьОбъект();
			Если ОбъектыАрхиваОбъект = Неопределено Тогда
				ДанныеФайла = Новый Структура;
				ДанныеФайла.Вставить("Хранение", 		Хранение);
				ДанныеФайла.Вставить("Имя",				ИмяФайлаБезРасширения+Расширение);
				ДанныеФайла.Вставить("Расширение",		Расширение);
				ДанныеФайла.Вставить("Комментарий",		Комментарий);
				
				ПомещенныеФайлы = Новый Массив;
				ПомещенныеФайлы.Добавить(ДанныеФайла);       
				
				МассивВладельцев = Новый Массив;
				МассивВладельцев.Добавить(СсылкаГрузоперевозки);
				
				CW_РаботаСФайламиСервер.ПрикрепитьФайлы(ПомещенныеФайлы, МассивВладельцев, ТипДокументаСсылка);   
				
			Иначе
				
				ДанныеФайла = Новый Структура;
				ДанныеФайла.Вставить("Наименование", 	НаименованиеОбъектаАрхива);
				ДанныеФайла.Вставить("ИмяФайла", 		ИмяФайлаБезРасширения+Расширение);
				ДанныеФайла.Вставить("Расширение", 		Расширение);
				ДанныеФайла.Вставить("Комментарий", 	Комментарий);
				ДанныеФайла.Вставить("Размер", 			РазмерБайт);
				ДанныеФайла.Вставить("Том", 			Том);
				ДанныеФайла.Вставить("ТипДокумента", 	ТипДокументаСсылка);
				ДанныеФайла.Вставить("Хранение", 		Хранение);
				
				CW_РаботаСФайламиСервер.ОбновитьДанныеСуществующегоФайла(ОбъектыАрхиваСсылка, ДанныеФайла);
				
			Конецесли;   
			
		КонецЦикла;
		//Файлы
		
		ДанынеСтатуса = CW_ЛогистическиеСтатусыСервер.ПолучитьДанныеЛогистическогоСтатуса(СсылкаГрузоперевозки);
	
		ГрузоперевозкаОбъект.ОбменДанными.Загрузка = истина;
		ГрузоперевозкаОбъект.Записать();
		
		//Запишем стутасы
		МассивСсылок = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ГрузоперевозкаОбъект.Ссылка);
		
		CW_ЛогистическиеСтатусыСервер.РассчитатьЛогистическийСтатус(МассивСсылок);
		CW_ФинансовыеСтатусыСервер.РассчитатьФинансовыйСтатус(МассивСсылок);
		//Запишем стутасы
		
		мИдетифкаторы.Добавить(XMLСтрока(ИдентификаторГрузоперевозки));
		
	Конеццикла;
	
	ХМЛ.Закрыть();
	
	СтрокаИдетифкаторы = СтрСоединить(мИдетифкаторы,";");
	
	//Формируем файл ответа
	ПутьФайлаОтвета = ПолучитьИмяВременногоФайла("xml");
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.ОткрытьФайл(ПутьФайлаОтвета);
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("data");  
	ЗаписьXML.ЗаписатьАтрибут("Item",	XMLСтрока(СтрокаИдетифкаторы));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	ЗаписьXML.Закрыть();

	Ответ = CW_РаботаСВнешнимиРесурсамиСервер.Ответ(200,,"xml");  
	Ответ.УстановитьИмяФайлаТела(ПутьФайлаОтвета);	
	
	Возврат Ответ;
	
КонецФункции

Функция filespost(Запрос)
	
	мИдетификаторы = Новый Массив;
	Том  = ПолучитьТом();

	Тело = Запрос.ПолучитьТелоКакСтроку();
	
	ХМЛ = Новый ЧтениеXML;
	ХМЛ.УстановитьСтроку(Тело);
	
	ПостроительDOM = Новый ПостроительDOM; 
	ДокументDOM = ПостроительDOM.Прочитать(ХМЛ);
	
	Элементы_file = ДокументDOM.ПолучитьЭлементыПоИмени("file"); //file
	
	//Файлы
	Для Каждого Элемент_file из Элементы_file Цикл  
		
		ИдентификаторОбъектаАрхива	= CW_ОбщийМодульЛичныйКабинетСервер.ПолучитьЗначениеИменованногоЭлемента(Элемент_file, "uid",  Тип("УникальныйИдентификатор"));
		ОбъектыАрхиваСсылка 		= Справочники.CW_ОбъектыАрхива.ПолучитьСсылку(ИдентификаторОбъектаАрхива);
		
		ОбъектыАрхиваОбъект = ОбъектыАрхиваСсылка.ПолучитьОбъект();
		Если ОбъектыАрхиваОбъект = Неопределено Тогда
			 Продолжить;
		Конецесли;

		НаименованиеОбъектаАрхива	= CW_ОбщийМодульЛичныйКабинетСервер.ПолучитьЗначениеИменованногоЭлемента(Элемент_file, "name", 		Тип("Строка"));
		ИмяФайлаБезРасширения		= CW_ОбщийМодульЛичныйКабинетСервер.ПолучитьЗначениеИменованногоЭлемента(Элемент_file, "filename", 	Тип("Строка"));
		Расширение					= CW_ОбщийМодульЛичныйКабинетСервер.ПолучитьЗначениеИменованногоЭлемента(Элемент_file, "extension", Тип("Строка"));
		Комментарий					= CW_ОбщийМодульЛичныйКабинетСервер.ПолучитьЗначениеИменованногоЭлемента(Элемент_file, "note", 		Тип("Строка"));
		
		Элементы_binarydata = Элемент_file.ПолучитьЭлементыПоИмени("binarydata"); 	
		Если Элементы_binarydata.Количество() > 0 Тогда
			Элемент_binarydata = Элементы_binarydata.Элемент(0);
			
			МассивДвоичныхДанных = Новый Массив;
			Для каждого Элемент_part из Элемент_binarydata.ДочерниеУзлы Цикл
				ДвоичныеДанные = Base64Значение(Элемент_part.ТекстовоеСодержимое);
				МассивДвоичныхДанных.Добавить(ДвоичныеДанные);
			КонецЦикла;
			
			ПолныеДвоичныеДанные = СоединитьДвоичныеДанные(МассивДвоичныхДанных);
			РазмерБайт 			 = ПолныеДвоичныеДанные.Размер();
			
			Хранение 			 = ПоместитьВоВременноеХранилище(ПолныеДвоичныеДанные);
			
		КонецЕсли;
		
		ИдентификаторТипаДокументов	= CW_ОбщийМодульЛичныйКабинетСервер.ПолучитьЗначениеИменованногоЭлемента(Элемент_file, "type", Тип("УникальныйИдентификатор"));
		
		Если ЗначениеЗаполнено(ИдентификаторТипаДокументов) Тогда
			ТипДокументаСсылка = Справочники.CW_ТипыДокументовФайловогоАрхива.ПолучитьСсылку(ИдентификаторТипаДокументов);
			ТипДокументаОбъект = ТипДокументаСсылка.ПолучитьОбъект();
			Если ТипДокументаОбъект = Неопределено Тогда
				ТипДокументаСсылка = ПредопределенноеЗначение("Справочник.CW_ТипыДокументовФайловогоАрхива.ПустаяСсылка");
			КонецЕсли;
		Иначе
			ТипДокументаСсылка = ПредопределенноеЗначение("Справочник.CW_ТипыДокументовФайловогоАрхива.ПустаяСсылка");
		КонецЕсли;    
		
		ДанныеФайла = Новый Структура;
		ДанныеФайла.Вставить("Наименование", 	НаименованиеОбъектаАрхива);
		ДанныеФайла.Вставить("ИмяФайла", 		ИмяФайлаБезРасширения+Расширение);
		ДанныеФайла.Вставить("Расширение", 		Расширение);
		ДанныеФайла.Вставить("Комментарий", 	Комментарий);
		ДанныеФайла.Вставить("Размер", 			РазмерБайт);
 		ДанныеФайла.Вставить("Том", 			Том);
  		ДанныеФайла.Вставить("ТипДокумента", 	ТипДокументаСсылка);
  		ДанныеФайла.Вставить("Хранение", 		Хранение);

		CW_РаботаСФайламиСервер.ОбновитьДанныеСуществующегоФайла(ОбъектыАрхиваСсылка, ДанныеФайла);
		
		мИдетификаторы.Добавить(XMLСтрока(ИдентификаторОбъектаАрхива));
		
	КонецЦикла;
	//Файлы
	
	СтрокаИдетифкаторы = СтрСоединить(мИдетификаторы,";");

	//Формируем файл ответа
	ПутьФайлаОтвета = ПолучитьИмяВременногоФайла("xml");
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.ОткрытьФайл(ПутьФайлаОтвета);
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("data");  
	ЗаписьXML.ЗаписатьАтрибут("Item",	XMLСтрока(СтрокаИдетифкаторы));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	ЗаписьXML.Закрыть();

	Ответ = CW_РаботаСВнешнимиРесурсамиСервер.Ответ(200,,"xml");  
	Ответ.УстановитьИмяФайлаТела(ПутьФайлаОтвета);	

	Возврат Ответ;
	
КонецФункции

Функция detailsget(Запрос)
	
	//Формируем файл ответа
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла("xml");
	
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.ОткрытьФайл(ИмяВременногоФайла);
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("data");  

	//Типы перевозок
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_ТипыПеревозок.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.CW_ТипыПеревозок КАК CW_ТипыПеревозок
	               |ГДЕ
	               |	CW_ТипыПеревозок.ПометкаУдаления = ЛОЖЬ
	               |	И CW_ТипыПеревозок.ЭтоГруппа = ЛОЖЬ";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("typеs");  
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("typе");  
		
		ЗаписьXML.ЗаписатьАтрибут("uid",	XMLСтрока(Выборка.Ссылка));
		ЗаписьXML.ЗаписатьАтрибут("name",	XMLСтрока(Строка(Выборка.Ссылка)));
		
		ЗаписьXML.ЗаписатьКонецЭлемента(); //typе
	
	КонецЦикла;
	
	ЗаписьXML.ЗаписатьКонецЭлемента(); //typеs
	//Типы перевозок
	
	//Параметры типов перевозок
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_ТипыПеревозокПараметрыГрузоперевозки.Ссылка КАК Ссылка,
	               |	CW_ТипыПеревозокПараметрыГрузоперевозки.Параметр КАК Параметр
	               |ИЗ
	               |	Справочник.CW_ТипыПеревозок.ПараметрыГрузоперевозки КАК CW_ТипыПеревозокПараметрыГрузоперевозки
	               |ГДЕ
	               |	CW_ТипыПеревозокПараметрыГрузоперевозки.Ссылка.ПометкаУдаления = ЛОЖЬ
	               |	И CW_ТипыПеревозокПараметрыГрузоперевозки.Ссылка.ЭтоГруппа = ЛОЖЬ";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("indicators");  
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("indicator");  
		
		ЗаписьXML.ЗаписатьАтрибут("uidtype",	XMLСтрока(Выборка.Ссылка));
		ЗаписьXML.ЗаписатьАтрибут("uid",		XMLСтрока(Выборка.Параметр));
		
		ЗаписьXML.ЗаписатьАтрибут("name",		XMLСтрока(Строка(Выборка.Параметр)));
		
		ЗаписьXML.ЗаписатьКонецЭлемента(); //indicator
		
	КонецЦикла;
	
	ЗаписьXML.ЗаписатьКонецЭлемента(); //indicators
	//Параметры типов перевозок

	//типы файлов
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	CW_ТипыДокументовФайловогоАрхива.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.CW_ТипыДокументовФайловогоАрхива КАК CW_ТипыДокументовФайловогоАрхива
	|ГДЕ
	|	CW_ТипыДокументовФайловогоАрхива.ПометкаУдаления = ЛОЖЬ";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("files");  
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("file"); 
		ЗаписьXML.ЗаписатьАтрибут("uid", XMLСтрока(Выборка.Ссылка));
		ЗаписьXML.ЗаписатьАтрибут("name", XMLСтрока(Строка(Выборка.Ссылка)));
		ЗаписьXML.ЗаписатьКонецЭлемента(); //file
		
	КонецЦикла;
	
	ЗаписьXML.ЗаписатьКонецЭлемента(); //files
	
	ЗаписьXML.ЗаписатьКонецЭлемента(); //data

	ЗаписьXML.Закрыть();
	
	Ответ = CW_РаботаСВнешнимиРесурсамиСервер.Ответ(200,,"xml");  
	Ответ.УстановитьИмяФайлаТела(ИмяВременногоФайла);	
	//типы файлов
	
	Возврат Ответ;
	
КонецФункции

Функция ПолучитьТом()
	
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	CW_ТомаАрхива.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.CW_ТомаАрхива КАК CW_ТомаАрхива
	               |ГДЕ
	               |	CW_ТомаАрхива.Основной = ИСТИНА
	               |	И CW_ТомаАрхива.Активный = ИСТИНА";
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции
